import React from 'react'
import Layout from '../../components/Layout/Layout'

import './About.css'
function AboutUs() {
    let hidden = true;

    function click(){
        let cont = document.getElementById("cont")
        if(hidden){
            cont.style.height = "1700px"
            hidden = false;
        }
        else{
            cont.style.height = "0px"
            hidden = true;
        }
    }
    return(
    <Layout>
        <div className="top">
            <div className="forCust">
                <span className="title">Для покупців<br/><br/></span>
                <span className="subText">Саме для Вас у нас є унікальна пропозиція: можливість швидко і зручно знайти найвигіднішу пропозицію в світі комп'ютерних ігор. Для тих, хто визначається з вибором, в кожному розділі є підбір за параметрами і можливість порівняти товари між собою. Доступний і зручний текстовий пошук, що дозволяє шукати як потрібні розділи, так і конкретні товари за назвою. А на сторінці кожної гри є докладна інформація, яка допоможе прийняти рішення: опис, характеристики, фото і відео, корисні посилання та відгуки. Там же знаходиться блок «Де купити?» зі списком інтернет-магазинів, цінами і прямими посиланнями на сторінку покупки.</span>
            </div>
            <div className="forOwn">
                <span className="title">Для власника  інтернет-магазину<br/><br/></span>
                <span className="subText">Ви звернулися за адресою, так як HotGamez - це інтернет-сервіс, що допомагає покупцеві знайти, порівняти і визначитись з вибором гри, магазину і зробити покупку.Ми не торгуємо, ми рекламуємо наявні у Вас товари. Таким чином, після розміщення товарів на HotGamez, наші відвідувачі стають Вашими покупцями.</span>
            </div>
        </div>
        <div className="center">
            <div className="ques">
                <span className="title">Питання та побажання по сайту</span>
                    <textarea placeholder="Напишіть тут своє питання/побажання..." id="wishes"></textarea>
                <button type="submit" className="sendwish"></button>
            </div>
            <div className="conf">
                <span className="title">Конфіденційність</span>
                <div onClick={click}><img  src="https://i.imgur.com/WHgYfN6.png" className="trigger" />  </div>
                <div className="content" id = "cont">
                    1. Збір інформації<br/>
                    Ми збираємо інформацію, коли ви реєструєтеся на сайті, заходьте на свій обліковий запис, виходите з облікового запису. Інформація включає ваш реєстраційний e-mail (логін).<br/>
                    Крім того, ми автоматично реєструємо ваш комп'ютер і браузер, включаючи IP, апаратні дані, а також адресу сторінки, що запитується на нашому сайті.<br/>
                    <br/>
                    2. Використання інформації<br/>
                    Інформація, яку ми отримуємо від вас, може бути використана, щоб:<br/>
                    Зробити послуги такими, що відповідають вашим індивідуальним запитам.<br/>
                    Запропонувати персональну рекламу<br/>
                    Поліпшити наш сайт<br/>
                    Поліпшити систему підтримки користувачів<br/>
                    Зв'язатися з вами електронною поштою суворо у випадках запиту від вас на надання інформації про зміну пароля, списки підібраних вами товарів та ін.<br/>
                    <br/>
                    3. Захист особистих даних<br/>
                    Ми єдиний власник інформації, зібраної на цьому сайті. Ваші особисті дані не будуть продані або будь-яким чином передані третім особам з будь-яких причин.<br/>
                    <br/>
                    4. Розкриття інформації третім особам<br/>
                    Ми не продаємо, не обмінюємо та не передаємо особисті дані стороннім компаніям.<br/>
                    Ми готові ділитися інформацією, щоб запобігти злочинам або допомогти в їхньому розслідуванні, якщо йдеться про підозру в шахрайстві, дії, які фізично загрожують безпеці людей суворо у випадках, коли це передбачено законом.<br/>
                    Неконфіденційна та неперсоналізована інформація може бути надана іншим компаніям з метою маркетингу, реклами тощо.<br/>
                    <br/>
                    5. Захист інформації<br/>
                    Ми використовуємо різні засоби безпеки, щоб гарантувати збереження ваших особистих даних. До ваших послуг найсучасніше шифрування. HotGamez також захищає ваші дані в режимі офлайн. Лише співробітники, які працюють із конкретним завданням (наприклад, технічна підтримка або використання сайту) отримують доступ до особистих даних. Сервера та комп'ютери, на яких записана конфіденційна інформація, знаходяться у безпечному оточенні.<br/>
                    <br/>
                    6. Використання файлів cookie<br/>
                    Наші файли cookie використовуються для покращення доступу до сайту та визначення повторних відвідувань. Крім того, вони дозволяють відстежити найцікавіші запити. Файли cookie не передають жодної конфіденційної інформації.<br/>
                    <br/>
                    7. Згода<br/>
                    Користуючись послугами нашого сайту, ви автоматично погоджуєтесь із нашою політикою конфіденційності.<br/> <br/>

                </div>
            </div>
        </div>
        <div className="bottom">
            <div className="zero"></div>
            <div className="links">
                <div className="title">Зворотній зв'язок</div>
                <img src="https://i.imgur.com/M6yallk.png"/>
                <img src="https://i.imgur.com/JKRkD6S.png"/>
                <img src="https://i.imgur.com/tUSYFTL.png"/>

            </div>
        </div>

    </Layout>
    )
}
export default AboutUs